app/views/fighters/index.html.erb

SELECT "genders".* FROM "genders" WHERE "genders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <td><%= fighter.phone %></td>
        <td><%= Gender.find(fighter.gender_id).name %></td>

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "martial_arts".* FROM "martial_arts" WHERE "martial_arts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <td><%= fighter.weight %></td>
        <td><%= Category.find(fighter.category_id).name %></td>
        <td><%= MartialArt.find(fighter.martial_art_id).name %></td>