app/views/fighters/show.html.erb

SELECT "genders".* FROM "genders" WHERE "genders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <strong>Gender:</strong>
  <%= Gender.find(@fighter.gender_id).name %>

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <strong>Category:</strong>
  <%= Category.find(@fighter.category_id).name %>

SELECT "martial_arts".* FROM "martial_arts" WHERE "martial_arts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  <strong>Martial art:</strong>
  <%= MartialArt.find(@fighter.martial_art_id).name %>