app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "gender_id", "weight", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Lagartos"], ["gender_id", 1], ["weight", 23.0], ["created_at", "2020-01-27 21:58:20.238413"], ["updated_at", "2020-01-27 21:58:20.238413"]]

    def set_category
      @category = Category.find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]