app/controllers/fighters_controller.rb

  def index
    @fighters = Fighter.all
---
SELECT "fighters".* FROM "fighters"

  def create
    @fighter = Fighter.new(fighter_params)

    respond_to do |format|
      if @fighter.save
---
INSERT INTO "fighters" ("firstname", "lastname", "gender_id", "date_of_birth", "height", "weight", "category_id", "martial_art_id", "activity_begin", "last_payment", "notes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @fighter.avatar.attach(params[:avatar])
    respond_to do |format|
      if @fighter.update(fighter_params)
---
UPDATE "fighters" SET "updated_at" = ? WHERE "fighters"."id" = ?  [["updated_at", "2020-03-11 01:14:53.262008"], ["id", 1]]

  def destroy
    @fighter.destroy
---
DELETE FROM "fighters" WHERE "fighters"."id" = ?  [["id", 1]]

    def set_fighter
      @fighter = Fighter.find(params[:id])
---
SELECT "fighters".* FROM "fighters" WHERE "fighters"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]