app/controllers/martial_arts_controller.rb

SELECT "martial_arts".* FROM "martial_arts"
---
  def index
    @martial_arts = MartialArt.all

INSERT INTO "martial_arts" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Karate"], ["created_at", "2020-01-26 22:26:30.384888"], ["updated_at", "2020-01-26 22:26:30.384888"]]
---
  def create
    @martial_art = MartialArt.new(martial_art_params)

    respond_to do |format|
      if @martial_art.save

UPDATE "martial_arts" SET "name" = ?, "updated_at" = ? WHERE "martial_arts"."id" = ?  [["name", "Kick Boxing"], ["updated_at", "2020-01-27 23:12:13.326446"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @martial_art.update(martial_art_params)

SELECT "martial_arts".* FROM "martial_arts" WHERE "martial_arts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_martial_art
      @martial_art = MartialArt.find(params[:id])