app/views/categories/index.html.erb

SELECT "genders".* FROM "genders" WHERE "genders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <td><%= category.name %></td>
        <td><%= Gender.find(category.gender_id).name %></td>