app/views/categories/show.html.erb

      <strong>Gender:</strong>
      <%= Gender.find(@category.gender_id).name  %>
---
SELECT "genders".* FROM "genders" WHERE "genders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]